blog-posts/2003-05-11-blogging-ideas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Blogging ideas</title>
<!-- 2014-04-30 Wed 17:46 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Blogging ideas</h1>
<p>
May 11th, 2003 -
<a href="http://sachachua.com/blog/p/758"><a href="http://sachachua.com/blog/p/758">http://sachachua.com/blog/p/758</a></a>
</p>

<p>
Richi Plana also wrote:
</p>

<blockquote>
<p>
I'm thinking of starting my own blog. I intend to create a system
which
 will act as my organizer, contacts list, diary/journal/blog and
infobase.
 I intend to write it from scratch (as opposed to adopting an existing
 project). I advocate code re-use just as much as the next guy, but
there
 are just some things which you want to do yourself (and no, it's not
the
 NIH mentality).
</p>

<p>
The backend will be filesystem-based and I intend to use XML. I'm
trying
 to decide whether to write things in PHP or Python. I'm leaning more
 towards PHP but Python's cool, too. I'll probably write it in PHP and
I've
 printed out all the PHP docs for XML handling.
</p>

<p>
I mentioned to you a long time ago how I wanted to move my web photo
album
 to a system with free-form output, right? Well, I was able to get one
step
 closer a few months back when I wrote the function to resize images
and I
 started that in PHP. May as well build from that.
</p>
</blockquote>

<p>
Hmmmmmmmm. &lt;looks at Emacs&gt;
</p>

<ul class="org-ul">
<li>Organizer? Check. (planner)
<ul class="org-ul">
<li>Contacts? Check. (bbdb)
</li>
<li>Diary/journal/blog? Check. (planner + emacs-wiki)
</li>
<li>Infobase? Check. (planner + remember)
</li>
<li>Filesystem-based? Check. (text files)
</li>
<li>XML? Hmmm, maybe I can write an export function.
</li>
</ul>
</li>
</ul>

<p>
=)
</p>

<p>
Emacs is the Way. ;)
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
